*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* 2005-09-30 DSH         Initial version                            *
* 2006-03-22 DSH RPI-251 Add test break on CGXR and verify trace    *
*********************************************************************
*                                                                   *
* This ez390 regression test program requires that the test remote  *
* input DDNAME be set to TESTTST1.TF1 file which contains test      *
* commands which are validated by the code in this program.         *
*                                                                   *
* Test sequence:                                                    *
*   1. Test register modify commands at first instruction           *
*   2. Test G and T for up to LR instruction                        *
*   3. Test modify memory at 300. And then run to CGXR to verify    *
*   4. Test jump and OC1 at bad opcode and then return via J 12R%   *
*   5. Zoom to end which includes verify of CGXR at resume point    *
*                                                                   *
*********************************************************************

         TITLE 'TESTTST1 TEST INTERACTIVE DEBUG COMMANDS'

TESTTST1 RT1  MAIN
         EQUREGS
MEMDATA  DS   0D
         DC   F'255'    300.=F'255'
         DC   H'50'     304.=H'50'
         DC   B'1001'   306.=B'1001'
         DC   C'HELLO'  307.=C'HELLO'
         DC   X'ABCDEF' 30C.=X'ABCDEF'
LMEMDATA EQU  *-MEMDATA
         RT1  START
         WTO  'TESTTST1 VERIFY MEMORY AND REG CHANGES BY TEST CMDS'
         L    R3,=A(X'300') LOW MEMORY WORK AREA FOR TEST
         CLC  0(LMEMDATA,R3),MEMDATA  VERIFY MEMORY CHANGES
         RT1  CCE
         CL   R4,=F'123'
         RT1  CCE                     VER R4 REG CHANGE
         LA   R12,RESUME AFTER J 12R AT CGXR BREAK
         LX   R8,=LH'1'
RESUME   EQU  *
         CGXR  7,0,8
         CL   7,=F'1'
         RT1  CCE
         RT1  END
         END