*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* 2005-09-30  DSH Initial version                                   *
*********************************************************************

TESTACT1 SUBENTRY
         WTO   'TESTACT1 TEST ACTR LIMIT IN OPEN CODE AND MACRO'
.LOOP    ANOP
&A       SETA  &A+1
         AIF   (&A LT 4000).LOOP
         WTO   'OPEN CODE A=&A'
         MACRO
         TEST
.LOOP    ANOP
&A       SETA  &A+1
         AIF   (&A LT 4000).LOOP
         WTO   'MACRO CODE A=&A'
         MEND
         TEST
         WTO  'TESTACT1 TEST ENDED OK'
         SUBEXIT
         END
