*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* Note: Needs extra macro file rt\test\TESTPRM1.MAC                 *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* 2005-09-30  DSH Initial version                                   *
*********************************************************************

TESTPRM1 SUBENTRY
         WTO   'TESTPRM1 TEST POSITIONAL AND KEYWORD PARMS'
POS0     TESTPRM1 POS1,KEY1=KEY1,POS2,,POS4,KEY2=,KEY3=KEY3
         MACRO
         TEST
         MNOTE 'P1=&SYSLIST(1)'
         MNOTE 'P1(1)=&SYSLIST(1)'
         MNOTE 'P1(1,2)=&SYSLIST(1,2)'
         MEND
         TEST (A,
         SUBEXIT
         END