*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* 2005-09-30  DSH         Initial version                           *
* 2006-02-24  DSH RPI-214 * OP IN SUBSTRING EXP, NO CONCAT AFTER    *
*                         SUBSTRING                                 *
* 2008-04-22  DSH RPI-833 Add string quotes for HLASM compatibility *
*********************************************************************

TESTMAC5 SUBENTRY
         WTO   'TESTMAC5 TEST RPI-214 * LAST OP, AND NO CONCAT .'
&T1      SETC  'ABC'(1+2*1,1)
         AIF   ('&T1' NE 'C').ERR
&T2      SETC  'ABC'(2,1)'DEF'
         AIF   ('&T2' NE 'BDEF').ERR
         WTO   'TESTMAC5 ENDED OK'
         SUBEXIT
         AGO   .EXIT
.ERR     MNOTE 12,'T1/T2 ERROR'
.EXIT    END