.*********************************************************************
.* Copyright 2005 Automated Software Tools Corporation               *
.* Copyright 2013 Cat Herder Software, LLC                           *
.* Copyright 2018 Joachim Bartz, Germany                             *
.*                                                                   *
.* This source code is part of z390 assembler/emulator package.      *
.*                                                                   *
.* The z390 package is distributed under GNU general public license  *
.*                                                                   *
.* Author - Don Higgins                                              *
.*********************************************************************
.* 2005-09-30  DSH         Initial version                           *
.* 2006-03-28  DSH RPI-266 Create TESTMAC8.MLC and TESTMAC8.MAC test *
.*                         inlines                                   *
.* 2006-04-09  DSH RPI-274 Test .EXIT on nested MEND                 *
.*********************************************************************

         MACRO
&L       TESTMAC8 &P,&K=
.LOOP    ANOP
&A       SETA  &A+1
         AIF   (&A LT 3).LOOP
         MNOTE 'TESTMAC8 L=&L P=&P K=&K A=&A'
         MACRO
&L       ILM4  &P,&K=
.LOOP    ANOP
&A       SETA  &A+1
         AIF   (&A LT 3).LOOP
         MNOTE 'ILM4 L=&L P=&P K=&K A=&A'
         MACRO
&L       ILM5  &P,&K=
.LOOP    ANOP
&A       SETA  &A+1
         AIF   (&A LT 3).LOOP
         MNOTE 'ILM5 L=&L P=&P K=&K A=&A'
         MNOTE 'TEST .EXIT FOR TESTMAC8 ILM5'
         AGO   .EXIT
.EXIT    MEND
L5       ILM5  P5,K=K5
         MNOTE 'TEST .EXIT FOR TESTMAC8 ILM4'
         AGO   .EXIT
.EXIT    MEND
L4       ILM4  P4,K=K4
         MNOTE 'TEST .EXIT FOR TESTMAC8 MACRO'
         AGO   .EXIT
.EXIT    MEND