*********************************************************************
* Copyright 2009 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* TESTAIN3.MLC                                                      *
* Test AINSERT complex macro and copy sequence.                     *
*********************************************************************
* 2009-09-16  DSH          Initial version                          *
* 2009-09-16  DSH RPI-1083 Test AINSERT complex macro and copy      *
*                          sequence                                 *
*********************************************************************

         MACRO
         STACK
         AINSERT 'L1 GEN',BACK
         AINSERT 'L2 GEN',BACK
         AINSERT 'L3 GEN',BACK
         MEND
         MACRO
&LAB     GEN  &TYPE
         MNOTE '&LAB GEN &TYPE STARTED'
         GBLB &(COPY_&LAB)
         AIF  (NOT &(COPY_&LAB))
              MNOTE 'GEN INSERTING &LAB GEN'
              AINSERT '&LAB GEN',FRONT
              MNOTE 'GEN INSERTING COPY &LAB'
              AINSERT ' COPY &LAB',FRONT
              :&(COPY_&LAB) SETB 1
         AELSE
              MNOTE 'GEN PUNCH &LAB'
         AEND
         MNOTE '&LAB GEN &TYPE ENDED'
         MEND
TESTAIN3 SUBENTRY
         WTO  'TESTAIN3 STARTED'
         STACK
         WTO   'TESTAIN3 ENDED'
         SUBEXIT
         END