.*********************************************************************
.* Copyright 2008 Automated Software Tools Corporation               *
.* Copyright 2013 Cat Herder Software, LLC                           *
.* Copyright 2018 Joachim Bartz, Germany                             *
.*                                                                   *
.* This source code is part of z390 assembler/emulator package.      *
.*                                                                   *
.* The z390 package is distributed under GNU general public license  *
.*                                                                   *
.* Author - Don Higgins                                              *
.*********************************************************************
.* TESTMAC9.MAC                                                      *
.* mz390 COPY support for macro files                                *
.*                                                                   *
.* Note: Uses TESTMAC9.CPY, is used by TESTMAC9.MLC                  *
.*********************************************************************
.* 2008-04-22  DSH         Initial version                           *
.* 2008-04-22  DSH RPI-833 Add string quotes for HLASM compatibility *
.*********************************************************************

         MACRO
         TESTMAC9
         COPY TESTMAC9
         AIF  ('&TESTMAC9' NE 'TESTMAC9').ERR
         WTO  'TESTMAC9 VAR FROM COPY OK'
         MEXIT
.ERR     WTO  'TESTMAC9 VAR NOT FOUND ERROR'
         MEND