*********************************************************************
* Copyright 2006 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* 2006 05-05 DSH         Initial version                            *
* 2006-05-05 DSH RPI-281 Add DCBE test of EODAD                     *
*********************************************************************

TESTDCB2 SUBENTRY
         WTO   'TESTDCB2 COPY SYSUT1 ASCII TEXT FILE TO SYSUT2 FIXED'
         OPEN  (SYSUT1,(INPUT),SYSUT2,(OUTPUT),SYSOUT,(OUTPUT))
LOOP     EQU   *
         GET   SYSUT1,RECORD
         AP    PTOT,=P'1'
         MVC   DTOT,=X'40202020'
         ED    DTOT,PTOT
         PUT   SYSOUT,MSG
         PUT   SYSUT2,RECORD
         B     LOOP
EOF      CLOSE (SYSUT1,,SYSUT2,,SYSOUT)
         WTO   'TESTDCB2 ENDED OK'
         SUBEXIT
SYSUT1   DCB   DDNAME=SYSUT1,RECFM=FT,LRECL=80,DCBE=DCBE1,MACRF=GM
DCBE1    DCBE  EODAD=EOF
SYSUT2   DCB   DDNAME=SYSUT2,RECFM=FB,LRECL=80,BLKSIZE=8000,MACRF=PM
SYSOUT   DCB   DDNAME=SYSOUT,RECFM=FT,BLKSIZE=120,MACRF=PM
PTOT     DC    PL2'0'
MSG      DS    0CL120
         DC    C'REC#='
DTOT     DC    CL4' ',C' TEXT='
RECORD   DC    CL80' '
         DC    (MSG+120-*)C' '
         DCBD
         END