*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* TESTPCH2.MLC                                                      *
* AREAD and PUNCH with explicit input and output file extensions    *
*********************************************************************
* 2005-09-30  DSH Initial version                                   *
* 2008-04-22  DSH RPI-833 Add string quotes for HLASM compatibility *
*********************************************************************

TESTPCH2 SUBENTRY
         WTO   'START TESTPCH2 AREAD AND PUNCH USING DDNAME FILES'
.LOOP    ANOP
&TEXT    AREAD DDNAME=SYSUT1
         AIF   ('&TEXT' EQ '').ENDLOOP
         WTO   '&TEXT'
         AGO   .LOOP
.ENDLOOP ANOP
         WTO   'END   AREAD TEXT'
         WTO   'START PUNCH TEST'
         PUNCH 'RECORD 1',DDNAME=SYSUT2
         PUNCH 'RECORD 2',DDNAME=SYSUT2
         WTO   'END TESTPCH2 OK'
         SUBEXIT
         END