*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* TESTMAC6.MLC                                                      *
* mz390 test complex keyword parameter parsing such as              *
* &OPTION=(A,B,C)                                                   *
*********************************************************************
* 2005-09-30  DSH         Initial version                           *
* 2006-03-13  DSH RPI-223 Support keyword parameter values of the   *
*                         form (A,B) etc.                           *
* 2006-03-20  DSH RPI-250 Test special characters within (.....)    *
*                         for keyword                               *
*********************************************************************

TESTMAC6 SUBENTRY
         WTO   'TESTMAC6 TEST RPI-223 SUPPORT OF COMPLEX KEY VALUES'
         MACRO
&NA      TEST  &K1=,&K2=1234,&K3=(A,B,C),                              X
               &K4='A B',&K5=('A, B'),&K6=' ',&K7=(?,?),&K8=X
         MNOTE  'K1=&K1'
         MNOTE  'K2=&K2'
         MNOTE  'K3=&K3'
         MNOTE  'K4=&K4'
         MNOTE  'K5=&K5'
         MNOTE  'K6=&K6'
         MNOTE  'K7=&K7'
         MNOTE  'K8=&K8'
         MEND
         TEST
         TEST  K3=(D,E,F),K4='C D'
         TEST  K3=(D,E,F),K4='C D'
         TEST  K3=(?,?),K4='C D'
         WTO   'TESTMAC6 ENDED OK'
         SUBEXIT
         END