*********************************************************************
* Copyright 2006 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* TESTPCH3.MLC                                                      *
* Copy two AREAD text files and also merge the two into third text  *
* file.                                                             *
* Note: Uses TESTPCH3.IN1, TESTPCH3.IN2                             *
*********************************************************************
* 2006-08-30 DSH         Initial version                            *
* 2006-09-08 DSH RPI-436 Test comments after AREAD/PUNCH parameters *
* 2008-04-22 DSH RPI-833 Add string quotes for HLASM compatibility  *
*********************************************************************

TESTPCH3 SUBENTRY
         WTO   'START TESTPCH3 COPY AND MERGE 2 TEST FILES'
.COPY1   ANOP
&TEXT    AREAD DDNAME=IN1,ID=1          TEST COMMENT 1
         AIF   ('&TEXT' EQ '').ENDCOPY1
         PUNCH '&TEXT',DDNAME=OT1,ID=1  TEST COMMENT 2
         PUNCH '&TEXT',DDNAME=OT3,ID=2
         AGO   .COPY1
.ENDCOPY1 ANOP
.COPY2   ANOP
&TEXT    AREAD DDNAME=IN2,ID=1
         AIF   ('&TEXT' EQ '').ENDCOPY2
         PUNCH '&TEXT',DDNAME=OT2,ID=1
         PUNCH '&TEXT',DDNAME=OT3,ID=2
         AGO   .COPY2
.ENDCOPY2 ANOP
         WTO   'END TESTPCH3 OK'
         SUBEXIT
         END