*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* TESTLNK1.MLC                                                      *
* LINK, LOAD, and DELETE macro and svcs                             *
*********************************************************************
* 2005-09-30 DSH         Initial version                            *
* 2005-11-13 DSH RPI-I89 Add test of link and load DSNAME and       *
*                        DDNAME options                             *
* 2006-09-11 DSH RPI-362 Change from test to rt\test directory      *
* 2007-02-07 DSH RPI-532 Correct path case for Linux                *
*********************************************************************

         TITLE 'TESTLNK1 TEST LINK, LOAD, AND DELETE'

TESTLNK1 RT1  MAIN
         EQUREGS
DSNFSUB1 DC   C'rt\test\TESTSUB1.390',X'00'    NULL TERM DSNAME FILE
DSNDSUB1 DC   C'rt\test',X'00'                 NULL TERM DSNAME DIR
DSNFDEMO DC   C'"demo\DEMO.390"'            ".." FILE
DSNDDEMO DC   C'"demo"'                     ".." DIR
DSNMDEMO DC   C'"rt\test;demo"'                     ".." MULT DIR LIST
         RT1  START
         LINK EP=TESTSUB1 EXEC IN AMODE31 PER LZ390 AMODE31 DEFAULT
         LOAD EP=TESTSUB1  USE=1
         LR   R3,R0
         LR   R15,R0
         BALR R14,R15
         LOAD EP=TESTSUB1  USE=2
         LR   R4,R0
         LR   R15,R3
         BALR R14,R15
         CLR  R3,R4
         RT1  CCE
         DELETE EP=TESTSUB1 USE-1
         DELETE EP=TESTSUB1 USE-0 CAUSES PHY DELETE
         LOAD EP=TESTSUB4 REPLACE OLD ADDR WITH DIFF MOD
         LR   R15,R0
         BALR R14,R15 EXEC IN CALLER AMODE31
         LOAD EP=TESTSUB1 RELOAD AT DIFF ADDR
         LR   R4,R0
         LR   R15,R0
         BALR R14,R15
         CLR  R3,R4
         RT1  CCH
         LINK EP=TESTSUB4 EXEC IN AMODE24 PER LZ390 AMODE24 OPTION
         LINK EP=TESTSUB4 AGAIN AND RETURN TO CALLER AMODE31
         LINK EP=TESTSUBX,DSNAME=DSNFSUB1  FILE NAME OVERRIDES EP
         LINK EP=TESTSUB1,DSNAME=DSNDSUB1  DIR
         LINK EP=XXXX,DSNAME=DSNFDEMO      FILE NAME OVERRIDES EP
         LINK EP=DEMO,DSNAME=DSNDDEMO      DIR
         LINK EP=DEMO,DSNAME=DSNMDEMO      MULT DIR LIST (DEMO IN 2ND)
         LINK EP=XXXX,DDNAME=DDTODEMO
         RT1  END
         END