*********************************************************************
* Copyright 2007 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* TESTSTA2.MLC                                                      *
* ESTAE restart and percolate higher level                          *
*********************************************************************
* 2007-06-10 DSH         Initial version                            *
* 2007-06-10 DSH RPI-636 Test R15=0 for percolate and cancel links  *
* 2007-07-18 DSH RPI-659 Test RESTART EXIT with R15=4 and R0=NEW    *
*                        RESTART PSW                                *
* 2008-06-22 DSH RPI-845 Change ESTAE EXIT to use R1=SDWA,          *
*                        R2=ESAEPARM                                *
*********************************************************************

         TITLE 'TESTSTA2 - TEST ESTAE EXIT RESTART AND PERCOLATE'

TESTSTA2 SUBENTRY
         WTO   'TESTSTA2 TEST ESTAE EXIT RESTART AND PERCOLATE'
         WTO   'TESTSTA2 SET  ESTAE EXIT FOR PEROCOLATE FROM TESTSTA3'
         ESTAE EXIT,PARAM=RESTART  
         WTO   'TESTSTA2 LINK TO TESTSTA3'
         LINK  EP=TESTSTA3
         WTO   'TESTSTA2 RETURN FROM TESTSTA3 SHOULD NOT OCCUR'
         ABEND 111,DUMP
RESTART  EQU   *
         BALR  R1,0              SET RESTART ADDRESSABILITY
         USING *,R1
         L     R13,=A(TESTSTA2+8) RELOAD TESTSTA2 BASE AND SAVE AREA
         DROP  R1
         WTO   'TESTSTA2 RESTARTED AFTER TESTSTA3 ABEND'
         WTO   'TESTSTA2 ENDING OK'
         SUBEXIT
         LTORG
         DROP
EXIT     DS    0H
*
* ENTERED VIA PERCOLATE FROM TESTSTA3 EXIT
* AFTER REMOVING TESTSTA3 FROM LINK STACK
*
         USING *,R15
         USING SDWA,R1
         WTO   'TESTSTA2 ESTAE EXIT REQUESTING RESTART'
         LR    R0,R2          REQUEST RESTART TASK AR ESAEPARM ADDR
         LA    R15,4          REQUEST RESTART CURRENT TASK AT (R0)
         BR    R14
         IHASDWA
         EQUREGS
         END