*********************************************************************
* Copyright 2009 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* TESTCDE1.MLC                                                      *
* List CDE's to test user interface                                 *
*********************************************************************
* 2009-09-16  DSH          Initial version                          *
* 2009-09-19  DSH RPI-1063 List CDE's to test user interface        *
*********************************************************************

TESTCDE1 SUBENTRY
         WTO   'TESTCDE1 - LIST CURRENT CDE ENTRIES'
         LOAD  EP=TESTCDE1 CHANGE USE COUNT FROM 1 TO 2
         LOAD  EP=REPRO    JUST TO TEST MULT LOADS
         L     R2,16
         USING IHACVT,R2
         L     R3,CVTCDE
         USING IHACDE,R3
         LA    R5,0                   SNAP ID
         DO    WHILE=(LTR,R3,NZ,R3)
               LA   R4,CDELEN(R3)     END OF CDE ADDR
               AHI  R5,1
               SNAP ID=(R5),STORAGE=((R3),(R4))
               L    R3,CDCHAIN
         ENDDO
         WTO   'TESTCDE1 ENDED'
         SUBEXIT
         EQUREGS
         CVTD
         CDED
         END