*********************************************************************
* Copyright 2006 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Note: Needs extra macro file rt\test\TESTSYN2.MAC                 *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* TESTSYN2.MLC                                                      *
* mz390 OPSYN used before and after last restore                    *
*********************************************************************
* 2006-04-30  DSH         Initial version                           *
* 2006-04-30  DSH RPI-306 Test OPSYN for MACRO VS OPCODE            *
* 2007-03-06  DSH RPI-352 Test OPSYN redefine of MAC OP             *
* 2006-08-07  DSH RPI-403 Test OPCODE used before first and after   *
*                         last restore                              *
*********************************************************************

TESTSYN2 SUBENTRY
         WTO   'TESTSYN2 STARTED'
         B     SKIPDC
         DC    C'DC BEFORE FIRST OPSYN'
SKIPDC   DS    0H
         PUSH  PRINT
_PUSH    OPSYN PUSH
PUSH     OPSYN TESTSYN2  * Using extra macro file here
         PUSH  123
TESTSYNX OPSYN TESTSYN2
         TESTSYNX ABC
         WTO   'TESTSYN2 ENDED'
         SUBEXIT
* TEST DC AFTER
DCX      OPSYN DC
DC       OPSYN MNOTE
         DC    'DC MNOTE'
DC       OPSYN DCX
         DC    C'DC AFTER OPSYN RESTORE'
         END