*********************************************************************
* Copyright 2007 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* TESTCIC2.MLC                                                      *
* Test assembly only of EXEC CICS SEND/RECEIVE with quoted literals *
*********************************************************************
* 2007-05-31 DSH         Initial version                            *
* 2007-06-13 DSH RPI-640 Test quoted strings in EXEC CICS           *
* 2008-02-01 DSH RPI-805 Test EXEC CICS comments with leading       *
*                        comma/period                               *
* 2008-06-13 DSH RPI-860 Allow commas to separate operands as well  *
*                        as spaces                                  *
* 2008-09-15 DSH RPI-905 Allow comma-space followed by comments on  *
*                        continued lines, merge keyword and (...)   *
*                        into single operand, generate label on     *
*                        EXEC statment if found. GEN EQUREGS        *
*********************************************************************

DFHEISTG DSECT       DSA STORAGE
MSGSBA   DS   CL4
SENDMSG  DS   CL100  MESSAGE BUFFER
MMMMCIC2 CSECT
*
* SEND MSG1 TO GUAM TN3270 TERMINAL
*
         MVC   MSGSBA,SBA11
         MVC   SENDMSG(L'MSG1),MSG1
         BAL   R14,GETTIME
         MVC   SENDMSG(13),TIMEHERE
    EXEC  CICS SEND FROM(MSGSBA) LENGTH(L'MSG1+4+C' '-C' ') ;RPI-640
    EXEC  CICS SEND FROM(MSGSBA) LENGTH(L'MSG1+4+C','-C'.') .RPI-860
    EXEC  CICS SEND FROM(MSGSBA) LENGTH(L'MSG1+4+C','-C'.'). RPI-805
    EXEC  CICS SEND FROM(MSGSBA) LENGTH(L'MSG1+4+C','-C'.') ,RPI-805
    EXEC  CICS SEND FROM(MSGSBA) LENGTH(L'MSG1+4+C','-C'.') .RPI-805
L1  EXEC  CICS SEND FROM(MSGSBA), COMMENT 1                            X
               LENGTH (L'MSG1+4+C','-C'.'), COMMENT 2 MERGE LENGTH(..)
    EXEC  CICS RETURN
*
GETTIME  EQU   *
         TIME  DEC,TIME,LINKAGE=SYSTEM
         MVO   TIMEPACK,TIME
         MVC   TIMEHERE(13),TIMEEDIT
         ED    TIMEHERE(13),TIMEPACK
         BR    R14
*
SBA11    TN3270 WCC_KD,(SBA,1,1)
MSG1     DC    C'  HH:MM:SS.TT HELLO FROM MMMMCIC2'
*
TIME     DS    CL4                HHMMSSTT
         DS    CL8                SPACE FOR DATE
TIMEPACK DC    PL5'0'             0HHMMSSTTC
TIMEEDIT DC    X'402120207A20207A20204B2020'
TIMEHERE DS    CL13
*
         TN3270 SYMBOLS
         EQUREGS
         EQUREGS , TEST SUPPRESSING DUPS RPI-905
         END