*********************************************************************
* Copyright 2005 Automated Software Tools Corporation               *
* Copyright 2013 Cat Herder Software, LLC                           *
* Copyright 2018 Joachim Bartz, Germany                             *
*                                                                   *
* This source code is part of z390 assembler/emulator package.      *
*                                                                   *
* The z390 package is distributed under GNU general public license  *
*                                                                   *
* Author - Don Higgins                                              *
*********************************************************************
* 2005-09-30 DSH         Initial version                            *
* 2005-11-18 DSH RPI-101 Correct open bug causing EOF error on GET  *
* 2005-11-19 DSH         Copy of TESTDCBD run in ASCII mode to      *
*                        verify no translate and also show ASCII vs *
*                        EBCDIC characters in SNAP dump             *
* 2006-09-11 DSH RPI-363 Change test to rt\test directory           *
* 2007-02-07 DSH RPI-532 Correct path case for Linux                *
*********************************************************************
* Test for RECFM=FT and VT create and read contributed by MM        *
*********************************************************************

TESTDCBE SUBENTRY
         OPEN (PUTFT,OUTPUT,PUTVT,OUTPUT)
         PUT  PUTFT
         PUT  PUTVT
         CLOSE (PUTFT,,PUTVT)
         OPEN (GETFT,INPUT,GETVT,INPUT)
         GET  GETFT
         GET  GETVT
         CLOSE (GETFT,,GETVT)
         SNAP STORAGE=(RECORD1,ENDIT),ID=1
         SUBEXIT
PUTFT    DCB   RECFM=FT,LRECL=80,MACRF=PM,RECORD=RECORD1,DSNAME=DSN1
PUTVT    DCB   RECFM=VT,LRECL=10,MACRF=PM,RECORD=RECORD2,DSNAME=DSN2
GETFT    DCB   RECFM=FT,LRECL=80,MACRF=GM,RECORD=RECORD3,DSNAME=DSN1
GETVT    DCB   RECFM=VT,LRECL=10,MACRF=GM,RECORD=RECORD4,DSNAME=DSN2

DSN1     DC    C'rt\test\TESTDCBE.TF2',X'00'
DSN2     DC    C'rt\test\TESTDCBE.TF3',X'00'
RECORD1  DC    X'C1C2C3414243',CL74' '
RECORD2  DC    H'10',H'0'
         DC    X'C1C2C3414243'
RECORD3  DC    CL80' '
RECORD4  DC    CL10' '
ENDIT    EQU   *
         DCBD
         EQUREGS
         END